app/views/messages/_chat_history.html.erb

SELECT "messages"."created_at" FROM "messages" WHERE "messages"."conversation_id" = $1 ORDER BY "messages".created_at ASC  [["conversation_id", 6002]]
---
	<div class="message-history">
		<% conversation.ordered_messages.each do |message| %>