app/views/messages/_show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT 1  [["id", 1242]]
---
				<%= image_tag message.user.profile_pic_url, :class => "message-pic sent" %>
				<div class="message-name sent"><%= message.user.first_name %></div>