app/views/conversations/chat.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1 ORDER BY "messages".created_at ASC  [["conversation_id", 18013]]
---
		<div class="message-history chat">
			<% @conversation.ordered_messages.each do |message| %>