app/views/conversations/show.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1 ORDER BY "messages".created_at ASC  [["conversation_id", 18017]]
---
<div class="message-history">
	<% @conversation.ordered_messages.each do |message| %>