app/controllers/conversations_controller.rb

	def show
		@conversation = Conversation.find params[:id]
		@message = Message.new(user_id: current_user.id, conversation_id: @conversation.id)
		@user = current_user
		@conversation.update_notifications current_user
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT 1  [["id", "13258"]]
UPDATE "messages" SET "seen" = 't' WHERE "messages"."conversation_id" = $1 AND "messages"."seen" = 'f' AND "messages"."user_id" = 1209  [["conversation_id", 13258]]
UPDATE "users" SET "message_count" = $1, "updated_at" = $2 WHERE "users"."id" = 1000  [["message_count", -3], ["updated_at", Sun, 22 Jun 2014 02:34:36 UTC +00:00]]

	def chat
		@other_user = User.find params[:user_id]
		@message = Message.new
		potential_convo = current_user.talked_to?(@other_user)
		if !potential_convo
			@conversation = Conversation.create name: "#{current_user.id}-#{@other_user.id}"
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT 1  [["id", 573]]
INSERT INTO "conversations" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 24 Jun 2014 02:26:17 UTC +00:00], ["name", "1001-4"], ["updated_at", Tue, 24 Jun 2014 02:26:17 UTC +00:00]]