app/controllers/events_controller.rb

	def index
		excursions = current_user.excursions
		invite_excursions = excursions.where(created: true)
		@invitations = invite_excursions.map(&:event).compact.select { |event| event.start_time > (current_user.user_time - 6.hours) && event.closed == "public" }.sort_by(&:start_time)
		@open = true
		@events = Event.where(closed: "public").select { |event| event.start_time > (current_user.user_time - 6.hours) && event.untouched_by?(current_user) }.sort_by(&:start_time)

		excursions.update_all seen: true
---
SELECT "events".* FROM "events" WHERE (start_time > '2014-06-22 03:10:54.629980') ORDER BY "events".start_time ASC
UPDATE "excursions" SET "seen" = 't' WHERE "excursions"."user_id" = $1 AND "excursions"."accepted" = 'f' AND "excursions"."passed" = 'f'  [["user_id", 1001]]

	def new
		@event = Event.new
		@user = User.find params[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1960"]]

	def create
		event = Event.new params[:event]
		invited_user = User.find params[:user_id]
		if event.save
			if !current_user.blocked_by?(invited_user)
				invited_user.event_count += 1
				invited_user.save
				event.users << [invited_user, current_user]
				excursion = Excursion.where(event_id: event.id, user_id: current_user.id)[0]
				excursion.update_attributes created: true, accepted: true
				broadcast user_path(invited_user)+ "/events", event.to_json
				if invited_user.notify_events && (!invited_user.active || !invited_user.using)
					EventMailerWorker.perform_async invited_user.id, current_user.id, event.id
					#NotificationMailer.event_notification(invited_user, current_user, event).deliver if invited_user.email
				end
				if event.image_url != nil
					redirect_to(:back) and return
				else
					render json: {ok: true} and return
				end
			else
				event.users << [current_user]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1960"]]
INSERT INTO "events" ("created_at", "location", "partner_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 22 Jun 2014 02:34:47 UTC +00:00], ["location", ""], ["partner_id", 0], ["title", ""], ["updated_at", Sun, 22 Jun 2014 02:34:47 UTC +00:00]]
UPDATE "users" SET "event_count" = $1, "updated_at" = $2 WHERE "users"."id" = 1960  [["event_count", 1], ["updated_at", Sun, 22 Jun 2014 02:34:47 UTC +00:00]]
SELECT "excursions".* FROM "excursions" WHERE "excursions"."event_id" = 11 AND "excursions"."user_id" = 1000
UPDATE "excursions" SET "created" = $1 WHERE "excursions"."id" = 15012  [["created", true]]
INSERT INTO "excursions" ("event_id", "user_id") VALUES ($1, $2) RETURNING "id"  [["event_id", 11], ["user_id", 1960]]