app/controllers/messages_controller.rb

SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 ORDER BY "conversations"."id" ASC LIMIT 1  [["id", 18013]]
INSERT INTO "messages" ("body", "conversation_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hey asshole"], ["conversation_id", 18013], ["created_at", Tue, 24 Jun 2014 02:26:20 UTC +00:00], ["updated_at", Tue, 24 Jun 2014 02:26:20 UTC +00:00], ["user_id", 1001]]
UPDATE "conversations" SET "updated_at" = '2014-06-24 02:26:20.688090' WHERE "conversations"."id" = 18013
UPDATE "users" SET "message_count" = $1, "updated_at" = $2 WHERE "users"."id" = 4  [["message_count", 1], ["updated_at", Tue, 24 Jun 2014 02:26:20 UTC +00:00]]
SELECT "users".* FROM "users" INNER JOIN "connections" ON "users"."id" = "connections"."user_id" WHERE "connections"."conversation_id" = $1 AND (user_id not in (1001))  [["conversation_id", 18013]]
---
	def create
		@message = Message.new params[:message]
		@message.user_id = current_user.id
		@message.conversation_id = params[:conversation_id]
		@conversation = Conversation.find(params[:conversation_id])
		@user = @conversation.get_other_user current_user
		if @message.save && !current_user.blocked_by?(@user)
			if !params[:event] == "true"
				@conversation.update_attributes initiated: true
				@conversation.update_attributes connected: true if (@conversation.connected == false) && @conversation.messages.map(&:user_id).include?(@user.id)