app/controllers/sessions_controller.rb

	def create
	  redirect_to main_path and return if current_user
	  auth_hash = request.env['omniauth.auth']
	  auth = Authorization.find_by_uid auth_hash['uid']
	  #redirect to user page if they've already authorized
	  if auth
	    session[:user_id] = auth.user.id
	    current_user.update_attributes active: true
---
SELECT "authorizations".* FROM "authorizations" WHERE "authorizations"."uid" = '597732702' LIMIT 1
UPDATE "users" SET "active" = $1, "updated_at" = $2 WHERE "users"."id" = 1001  [["active", true], ["updated_at", Wed, 25 Jun 2014 23:58:11 UTC +00:00]]

	def destroy
		current_user.update_attributes active: false;
---
UPDATE "users" SET "active" = $1, "updated_at" = $2 WHERE "users"."id" = 1001  [["active", false], ["updated_at", Wed, 25 Jun 2014 23:58:03 UTC +00:00]]