app/controllers/users_controller.rb

	def show
		if params[:id].to_i != current_user.id
			redirect_to user_path current_user
			return
		end
		@welcome = params["welcome"]
		@category = Category.where(name: "Do").first
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'Do' ORDER BY "categories"."id" ASC LIMIT 1